<a href="https://colab.research.google.com/github/ATechievision/DataHubArchana/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas
It is a library which is used for data manipulation.

1. Panel Data
2. Python Data Analysis

# Data types
1. Series: It is 1-d labelled data that will store data of same or different data type.
2. Data Frame: It is a 2-d labelled that will store data in rows and columns.

In [4]:
import pandas as pd

 #How to create a series data that will store my labelled data in a 1-d format.
data= [11,12,'apple',8,'12.34','banana']
s1=pd.Series(data)
s1

0        11
1        12
2     apple
3         8
4     12.34
5    banana
dtype: object

In [6]:
data=[11,12,23,8,55.55]
s1=pd.Series(data)
s1

0    11.00
1    12.00
2    23.00
3     8.00
4    55.55
dtype: float64

In [7]:
data=[11,12,23,8,55]
s1=pd.Series(data)
s1

0    11
1    12
2    23
3     8
4    55
dtype: int64

In [8]:
print(type(data))

<class 'list'>

In [14]:
#How to remove this dtype.
data=[11,12,23,8,55,'banana','55,55']
s1=pd.Series(data)

print(s1.to_string(dtype=False))#s1.to_string(dtype=False) # to_string(dtype=False)---> this will remove dtype

#print(s1.to_string(dtype=True))-doesn't remove the dtype

0        11
1        12
2        23
3         8
4        55
5    banana
6     55,55
dtype: object

In [15]:
data=[11,12,23,8,55,'banana','55,55','apple']
s1=pd.Series(data)
print(s1.to_string(index=False)) #to_string(index=False) -->this will remove my indexes.

    11
    12
    23
     8
    55
banana
 55,55
 apple

# How to add my own labes in place of default labels.

In [18]:
data=[11,12,55,'banana','55,55','apple']
s1=pd.Series(data, index=['first','second','third','fourth','fifth','sixth'])
s1

first         11
second        12
third         55
fourth    banana
fifth      55,55
sixth      apple
dtype: object

# How to access the values in the series by using indexes operation.

In [23]:
data=[11,12,55,'banana','55,55','apple']
s1=pd.Series(data)
s1
#print(s1.to_string(index=False))

0        11
1        12
2        55
3    banana
4     55,55
5     apple
dtype: object

In [21]:
# I want to access the values present at the index 4

print(s1[4])

print(s1[0])

55,55
11

# Can we use some other data type to create as series

In [24]:
# create a series with list
data=[11,12,55,'banana','55,55','apple']
s1=pd.Series(data)
s1

0        11
1        12
2        55
3    banana
4     55,55
5     apple
dtype: object

In [25]:
# create a series with tuple
data=(11,12,55,'banana','55,55','apple')
s1=pd.Series(data)
s1

0        11
1        12
2        55
3    banana
4     55,55
5     apple
dtype: object

In [26]:
# set are unordered -> not ideal for series directly.

#Convert them to a list or tuple_>pd.Series(list(data))
# create a series with set-->list
data={11,12,55,'banana','55,55','apple'}
s1=pd.Series(list(data))
s1=pd.Series(tuple(data))
s1

0    banana
1     55,55
2        55
3        11
4        12
5     apple
dtype: object

In [29]:
# create a series with dictionary(key will act as label)

data={'name' : 'python' , 'DOB' : 1991}
s1= pd.Series(data)
s1

name    python
DOB       1991
dtype: object

# Slicing operation in series

# Extra points to remember: -Series is 1-D --> only one feature --> only one column

In [30]:
data=[11,12,15,19,678,'Mango','Banana','xyz']
s1=pd.Series(data)
s1

0        11
1        12
2        15
3        19
4       678
5     Mango
6    Banana
7       xyz
dtype: object

In [32]:
#i want to access from 12 to 19

print(s1[1:4])

1    12
2    15
3    19
dtype: object

In [37]:
data=[11,12,15,19,678,'Mango','Banana','xyz']
s1=pd.Series(data,index=['first','second','third','fourth','fifth','d','e','f'])
print(s1)

first         11
second        12
third         15
fourth        19
fifth        678
d          Mango
e         Banana
f            xyz
dtype: object

In [38]:
print(s1['second':'d'])

second       12
third        15
fourth       19
fifth       678
d         Mango
dtype: object